# 菜鸡Android开发攻城狮

## 介绍

| 姓名     | 咸鱼至尊                                          |
| -------- | ------------------------------------------------- |
| 年龄     | 22                                                |
| 工作年限 | 1                                                 |
| 婚姻状况 | 单身                                              |
| 所在城市 | 山东青岛                                          |
| 期望薪资 | *1-1.2W*                                          |
| 擅长领域 | **吹逼/斗图**  **写BUG/找BUG**  **Ctrl+C/Ctrl+V** |
| 资产情况 | ***三房一车(总资产1KW)***                         |



## 教育

2018 - 2020    潍坊职业学院    大专



## 技能点

- 熟悉Java/Kotlin
- 熟练使用Android Studio
- 熟悉MVP/MVVM代码结构
- 熟悉三方库/UI组件
- 擅长UI组件的复制粘贴
- 擅长代码的复制粘贴/东拼西凑
- 熟练使用Windows10
- 长期写辣鸡代码以及冗余注释



## 成就

中级CV攻城狮

吹水龙王🐉



## 名言

天下辣鸡代码共一石，我独占八斗

不写注释的不叫程序猿，叫码农



## 公司

| 时间              | 公司名称                   | 职位     |
| ----------------- | -------------------------- | -------- |
| 2021.08 - 2021.10 | 青岛通软网络科技有限公司   | 安卓开发 |
| 2020.10 - 2021.07 | 康吉诺(青岛)工业设备研究院 | 安卓开发 |



## 项目

### 玩Android

2021.12 - 至今	独立开发

Kotlin版的玩安卓项目APP，使用玩Android网站提供的API接口，集成了不少三方开源库，参考了三个玩安卓项目的UI，内置了很多工具类扩展函数及各式UI组件

- 躺平、摆烂、摸鱼划水
- 写最少的代码，搞最多的BUG
- 解决不了BUG，就解决提出BUG的人



### 人脸识别

2021.08 - 2021.10	安卓开发

基于旷视人脸识别算法做的人脸识别程序，用作智慧园区、智慧停车等终端

- 负责提BUG，搞UI
- 优化屎山代码



### 太阳纸业_设备管理平台

2021.03 - 2021.07	安卓开发

定制化设备管理平台

- 用户体验分析师
- 研究怎样能让UI更丑一点，代码更屎一点，顺便使用接口跟框架自己写了一版



### 鲁南中联水泥_设备管理平台

2021.01 - 2021.07	安卓开发助理

设备管理平台初版，和平台数据交互的数据可视化软件

- 负责提BUG，写BUG，怼APP开发经理
- 聊天打屁、吃吃喝喝



## 评价

- 注重代码可读性/耦合度/规范性
- 注重代码的注释
- UI审美独特
- 保持高质量代码和提交记录
- 热爱技术和代码
- 熟悉团队协作
- 结合实际需求思考技术选型



## 开源网站

- [GITHUB](https://github.com/SaltedFish-Extreme)
- [GITEE](https://gitee.com/SaltedFish-Extreme)



## 联系方式

- QQ：1738099872
- 微信：同上
- 电话：见BOSS直拒
